In [1]:
import numpy as np
import pandas as pd

In [2]:
sales = pd.Series([100, 200, 100, 400])
print(sales.values)

[100 200 100 400]

In [3]:
print(sales.index)

RangeIndex(start=0, stop=4, step=1)

In [4]:
sales = pd.Series([100, 200, 100, 400], index = ['a', 'b', 'c', 'd'])
print(sales)

a    100
b    200
c    100
d    400
dtype: int64

In [5]:
print(sales.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'Mar', 'Apr'], name = "4 Months Sales")
print(sales)

Jan    100
Feb    200
Mar    100
Apr    400
Name: 4 Months Sales, dtype: int64

In [7]:
canteen = pd.Series([300, 400, 100, 700, 300, 200, 200], index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], name = "Sandwiches Sold in One Week")
print(canteen)

Mon    300
Tue    400
Wed    100
Thu    700
Fri    300
Sat    200
Sun    200
Name: Sandwiches Sold in One Week, dtype: int64

In [8]:
print(canteen[1])

400

In [10]:
print(canteen["Tue"])

400

In [11]:
print(canteen[[3, 5]])

Thu    700
Sat    200
Name: Sandwiches Sold in One Week, dtype: int64

In [12]:
print(canteen[["Tue", "Fri"]])

Tue    400
Fri    300
Name: Sandwiches Sold in One Week, dtype: int64

In [13]:
print(canteen[canteen > 200])

Mon    300
Tue    400
Thu    700
Fri    300
Name: Sandwiches Sold in One Week, dtype: int64

In [16]:
canteen = canteen // 2
print(canteen)

Mon     75
Tue    100
Wed     25
Thu    175
Fri     75
Sat     50
Sun     50
Name: Sandwiches Sold in One Week, dtype: int64

In [17]:
"Fri" in canteen

True

In [18]:
200 in canteen

False

In [19]:
50 in canteen

False

In [21]:
arr = np.array([3, 2, 4, 5, 6])
ind = np.array(['a', 'b', 'c', 'd', 'e'])

In [22]:
obj2 = pd.Series(arr, index = ind)
obj2

a    3
b    2
c    4
d    5
e    6
dtype: int32

In [24]:
state = {
    'Sindh': 350,
    'Punjab': 300,
    'Kpk': 200,
    'Balochistan': 400
}

tax_by_state = pd.Series(state)
tax_by_state

Sindh          350
Punjab         300
Kpk            200
Balochistan    400
dtype: int64

In [25]:
print(tax_by_state.index)

Index(['Sindh', 'Punjab', 'Kpk', 'Balochistan'], dtype='object')

In [28]:
tax_by_state = pd.Series(state, index = ['Sindh', 'Kpk', 'Punjab', 'Balochistan'])
tax_by_state

Sindh          350
Kpk            200
Punjab         300
Balochistan    400
dtype: int64

In [29]:
tax_by_state = pd.Series(state, index = ['Sindh', 'Kpk', 'Punjab', 'Balochistan', 'Kashmir'])
tax_by_state

Sindh          350.0
Kpk            200.0
Punjab         300.0
Balochistan    400.0
Kashmir          NaN
dtype: float64

In [30]:
print(pd.isnull(tax_by_state))

Sindh          False
Kpk            False
Punjab         False
Balochistan    False
Kashmir         True
dtype: bool

In [31]:
tax_by_state.isnull()

Sindh          False
Kpk            False
Punjab         False
Balochistan    False
Kashmir         True
dtype: bool

In [32]:
tax_by_state.name = "State Tax Paying"

In [33]:
tax_by_state

Sindh          350.0
Kpk            200.0
Punjab         300.0
Balochistan    400.0
Kashmir          NaN
Name: State Tax Paying, dtype: float64

In [34]:
tax_by_state.index.name = "States Name"
tax_by_state

States Name
Sindh          350.0
Kpk            200.0
Punjab         300.0
Balochistan    400.0
Kashmir          NaN
Name: State Tax Paying, dtype: float64

In [2]:
# index should be same for merging two or more series to make dataframe
import pandas as pd
apples = pd.Series([3, 2, 0, 1])
oranges = pd.Series([3, 2, 0, 1])

print(apples, oranges)

0    3
1    2
2    0
3    1
dtype: int64 0    3
1    2
2    0
3    1
dtype: int64

In [3]:
data = {
    "apples": apples,
    "oranges": oranges
}

fruit_df = pd.DataFrame(data)

In [4]:
print(fruit_df)

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [5]:
data = {
    'State': ['Ohio', 'Nevada', 'Ohio', 'Ohio'],
    'Year': [2000, 1999, 1998, 2017],
    'Population': [1.5, 1.8, 3.6, 8.4]
}
frame = pd.DataFrame(data)

In [6]:
print(frame)

    State  Year  Population
0    Ohio  2000         1.5
1  Nevada  1999         1.8
2    Ohio  1998         3.6
3    Ohio  2017         8.4

In [7]:
frame.index = ['1st', '2nd', '3rd', '4th']

In [8]:
print(frame)

      State  Year  Population
1st    Ohio  2000         1.5
2nd  Nevada  1999         1.8
3rd    Ohio  1998         3.6
4th    Ohio  2017         8.4

In [9]:
frame.head()

      State  Year  Population
1st    Ohio  2000         1.5
2nd  Nevada  1999         1.8
3rd    Ohio  1998         3.6
4th    Ohio  2017         8.4

In [10]:
frame.head(1)

    State  Year  Population
1st  Ohio  2000         1.5

In [11]:
frame.columns = ['state', 'year', 'pop']
frame

      state  year  pop
1st    Ohio  2000  1.5
2nd  Nevada  1999  1.8
3rd    Ohio  1998  3.6
4th    Ohio  2017  8.4

In [12]:
frame2 = pd.DataFrame(data, 
                      columns = ['State', 'Year', 'Population', 'Debt'], 
                      index = ['One', 'Two', 'Three', 'Four']
                     )
frame2.head(2)

      State  Year  Population Debt
One    Ohio  2000         1.5  NaN
Two  Nevada  1999         1.8  NaN

In [13]:
frame2.columns

Index(['State', 'Year', 'Population', 'Debt'], dtype='object')

In [14]:
frame2.index

Index(['One', 'Two', 'Three', 'Four'], dtype='object')

In [15]:
frame2["State"]

One        Ohio
Two      Nevada
Three      Ohio
Four       Ohio
Name: State, dtype: object

In [17]:
frame2.State

One        Ohio
Two      Nevada
Three      Ohio
Four       Ohio
Name: State, dtype: object

In [18]:
frame2.loc["Three"]

State         Ohio
Year          1998
Population     3.6
Debt           NaN
Name: Three, dtype: object

In [19]:
frame2.loc[:, "Year"]

One      2000
Two      1999
Three    1998
Four     2017
Name: Year, dtype: int64